# PartMakerDivisionProfileOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PartMakerDivisionProfileOffset Property
ParameterTypeId Class See Also
---
"Profile Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PartMakerDivisionProfileOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartMakerDivisionProfileOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PartMakerDivisionProfileOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace